==============
LITERAL VALUES
==============
// Hello, world!
unit
true
false
100
"Hello"
2 * 2
a = 10
f"formatted"
---

(source_file
  (comment)
  (literal
    (unit))
  (literal
    (boolean))
  (literal
    (boolean))
  (literal
    (number))
  (literal
    (string))
  (binary_expression
    (literal
      (number))
    (literal
      (number)))
  (name_definition
    (identifier)
    (literal
      (number)))
  (literal
      (fstring)))

===================
FUNCTION DEFINITION
===================
F : X Y = X + Y
_ : A B = if true then A else B
---

(source_file
  (function
    (identifier)
    (parameter_list
      (identifier)
      (identifier))
    (binary_expression
      (literal
        (identifier))
      (literal
        (identifier))))
  (lambda
    (wildcard)
    (parameter_list
      (identifier)
      (identifier))
    (if_statement
      (literal
        (boolean))
      (literal
        (identifier))
      (literal
        (identifier)))))

=======================
IF-THEN-ELSE EXPRESSION
=======================
if true then 1 else 2
---

(source_file
  (if_statement
    (literal
      (boolean))
    (literal
      (number))
    (literal
      (number))))
==========
CONSTRUCTS
==========
1, 2, 3
cons 1 cons 2 3
cons cons 1 2 cons 3 4
A, B, C = 1, 2, 3
D, E, F = func()
---
(source_file
    (binary_expression
      (literal
        (number))
      (binary_expression
        (literal
          (number))
        (literal
          (number))))
    (binary_expression
      (literal
        (number))
      (binary_expression
        (literal
          (number))
        (literal
          (number))))
    (binary_expression
      (binary_expression
        (literal
          (number))
        (literal
          (number)))
      (binary_expression
        (literal
          (number))
        (literal
          (number))))
  (name_definition
    (identifier)
    (identifier)
    (identifier)
    (binary_expression
      (literal
        (number))
      (binary_expression
        (literal
          (number))
        (literal
          (number)))))
  (name_definition
    (identifier)
    (identifier)
    (identifier)
    (application
        (literal
            (identifier))
        (arguments))))
===========
APPLICATION
===========
f()
f(;)
f(1;2;3;)
f(unit _:= 0)
{1}(1)
g(1;_)
---
(source_file
    (application
        (literal (identifier))
        (arguments))
    (application
        (literal (identifier))
        (arguments))
    (application
        (literal (identifier))
        (arguments
            (literal (number))
            (literal (number))
            (literal (number))))
    (application
        (literal (identifier))
        (arguments
            (literal (unit))
            (lambda
                (wildcard)
                (parameter_list)
                (literal (number)))))
    (application
        (block
            (literal (number)))
        (arguments
            (literal (number))))
    (application
        (literal (identifier))
        (arguments
            (literal (number))
            (wildcard))))
====================
APPLYING EXPRESSIONS
====================
f(1 + 2)
f(1, 2, 3)
---
(source_file
    (application
        (literal (identifier))
        (arguments
            (binary_expression
                (literal (number))
                (literal (number)))))
    (application
        (literal (identifier))
        (arguments
            (binary_expression
                (literal (number))
                (binary_expression
                    (literal (number))
                    (literal (number)))))))
==============
LISTS AND MAPS
==============
[]
[=>]
list = [1 2;3]
map = ["A" => 1;"B" => 2 "C" => 3]
---
(source_file
    (literal (list))
    (literal (map))
    (name_definition
        (identifier)
        (literal
            (list
                (literal (number))
                (literal (number))
                (literal (number)))))
    (name_definition
        (identifier)
        (literal
            (map
                (string)
                (literal (number))
                (string)
                (literal (number))
                (string)
                (literal (number))))))
=================
MATCH EXPRESSIONS
=================
match 2
| 1 => false
| 2 => true
| 3 => false
match match 1 | 1 => 2 | 2 => 3
---
(source_file
    (match
        (pivot
            (literal (number)))
        (case
            (literal (number))
            (literal (boolean)))
        (case
            (literal (number))
            (literal (boolean)))
        (case
            (literal (number))
            (literal (boolean))))
    (match
        (pivot
            (match
                (pivot
                    (literal (number)))
                (case
                    (literal (number))
                    (literal (number)))
                (case
                    (literal (number))
                    (literal (number)))))))
===================
OPERATOR PRECEDENCE
===================
func(1,2)
|> another_func
|> third("param" _)
cons 1 A()
list[3:8]
---
(source_file
    (binary_expression
        (binary_expression
            (application
                (literal (identifier))
                (arguments
                    (binary_expression
                        (literal (number))
                        (literal (number)))))
            (literal (identifier)))
        (application
            (literal (identifier))
            (arguments
                (literal (string))
                (wildcard))))
    (binary_expression
        (literal (number))
        (application
            (literal (identifier))
            (arguments)))
    (subscript
        (literal (identifier))
        (arguments
            (literal (number))
            (pivot)
            (literal (number)))))
